export const paymentRadios = [{title: "Онлайн на сайте", question: "Оплата товара наличными при получении в отделении Почты России, дополнительно оплачивается сбор в размере 2% от суммы платежа"},
{title: "Наложенным платежом", question: "Оплата товара наличными при получении в отделении Почты России, дополнительно оплачивается сбор в размере 2% от суммы платежа"},
{title: "Безналичный расчет", question: "Оплата товара наличными при получении в отделении Почты России, дополнительно оплачивается сбор в размере 2% от суммы платежа"},
]
export const deliveryRadios = [{title: "Курьерская служба", question: "Стоимость доставки рассчитывается при звонке менеджером"}, 
{title: "Почта России", question: "Стоимость доставки рассчитывается при звонке менеджером"},]
