import { IShopItem } from "../types/shopItem";
import img0 from "../assets/images/tattoo-mashine/1.png";
import img11 from "../assets/images/tattoo-mashine/2_1.png";
import img12 from "../assets/images/tattoo-mashine/2_2.png";
import img13 from "../assets/images/tattoo-mashine/2_3.png";
import img14 from "../assets/images/tattoo-mashine/2_4.png";
import img2 from "../assets/images/tattoo-mashine/3.png";
import img3 from "../assets/images/tattoo-mashine/4.png";
import img4 from "../assets/images/tattoo-mashine/5.png";
import img5 from "../assets/images/tattoo-mashine/6.png";
import img6 from "../assets/images/tattoo-mashine/7.png";
import img7 from "../assets/images/tattoo-mashine/8.png";

export const minishopData: IShopItem[] = [
  {
    id: 0,
    name: "Foxxx Kitsune Mini Black Vintage RCA",
    price: 6000,
    oldPrice: 0,
    img: {
      img0: img0,
      img1: img0,
      img2: img0,
      img3: img0 ,

    },
    marcers: {
      new: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 8,
    type: "tattoo-machine",
    brand: "Aliance",
  },
  {
    id: 1,
    name: "Foxxx Viper Fox Golden Vintage Lot #1 RCA",
    price: 34920,
    oldPrice: 36000,
    img: {
      img0: img11,
      img1: img12,
      img2: img13,
      img3: img14,

    },
    marcers: {
      new: true,
      hot: true,
      promotion: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 4,
    type: "tattoo-machine",
    
    brand: "Aliance",
  },
  {
    id: 2,
    name: "Нитровиниловые перчатки Wally Plastic S",
    price: 20,
    oldPrice: 0,
    img: {
      img0: img2,
      img1: img2,
      img2: img2,
      img3: img2,

    },
    marcers: {
      new: true,
      promotion: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    count: 45,
    type: "consumables",
    brand: "Aliance",
  },
  {
    id: 3,
    name: "Forever Cartridge Grip Ergo 30 mm Огненно-Рыжий",
    price: 2037,
    oldPrice: 0,
    img: {
      img0: img3,
      img1: img3,
      img2: img3,
      img3: img3,

    },
    marcers: {
      new: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 3,
    type: "holders",
    brand: "Aliance",
  },
  {
    id: 4,
    name: "Verge Direct 2.1 Pink gip EGO 4 mm liners",
    price: 2037,
    oldPrice: 0,
    
    img: {
      img0: img4,
      img1: img4,
      img2: img4,
      img3: img4,

    },
    marcers: {
      new: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 11,
    type: "tattoo-machine",
    brand: "Aliance",
  },
  {
    id: 5,
    name: "Deuce Machines Direct Drive #7 RCA Samurai",
    price: 8000,
    oldPrice: 0,
    img: {
      img0: img5,
      img1: img5,
      img3: img5,
      img2: img5,

    },
    marcers: {
      new: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 12,
    type: "tattoo-machine",
    brand: "Aliance",
  },
  {
    id: 6,
    name: "Cyborg Machines Alter Rotary Axis Cross Sexy Nymph",
    price: 11000,
    oldPrice: 0,
    img: {
      img0: img6,
      img1: img6,
      img2: img6,
      img3: img6,

    },
    marcers: {
      new: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 3,
    type: "tattoo-machine",
    brand: "Aliance",
  },
  {
    id: 7,
    name: "Verge Direct 2.1 Gunmetal",
    price: 10900,
    oldPrice: 0,
    img: {
      img0: img7,
      img1: img7,
      img2: img7,
      img3: img7,

    },
    marcers: {
      new: true,
    },
    description: "Viper - машинка собрана на мощном моторе, рама данной модели сделана из прочного и лёгкого алюминиевого сплава. В связи с этим вес данной машины всего 120g./\
    Данная модель оснащена регулируемым эксцентриком. Для регулировки нужного вам хода иглы просто перемещайте ваш держатель в зажиме, вперёд или назад. Так же эксцентрик спроектирован так, что на машине отсутствует центробежная тяга, в следствии чего отсутствует вибрация в процессе работы. Под крепление бандажной резинки предусмотрен небольшой и удобный штифт снизу./\
    Диаметр зажимного болта сделан больше чем на аналогах — так что держатель фиксируется без проблем и лишних усилий. Данная модель без труда толкает любые иглы и картриджи./\
    Все необходимые рекомендации предусмотрены на прилагаемой к машинке инструкции, вложенной в коробку с товаром./\
    Машинка подходит как для тату, так и для татуажа.",
    characteristics: {
      purpose: "Универсальная",
      connector: "RCA",
      manufacturer: "Foxxx Irons (Россия)",
      type: "Роторная",
      needleStroke: "Универсальная",
      voltage: 12 
    },
    count: 0,
    type: "tattoo-machine",
    brand: "Aliance",
  },
];
