import { IReview } from "../types/entity/review";
import img1 from "../assets/images//reviews/1.png"
import img2 from "../assets/images//reviews/2.png"
export const reviews: IReview[] = [
    {
        id: 0,
        text: "Заказал первый раз, заказ пришёл во время, упаковано все отлично, все заказанное соответствует описанию, но есть один маленький ньюанс, коробки все мятые, толи при упаковке так случилось толи на складе так отномятся с товаром, в целом всем доволен, буду заказывать ещё, сайт-магазин рекомендую к покупкам, в целом всем доволен, буду заказывать ещё",
        img: img1,
        inst: "Velli7350"
    },
    {
        id: 1,
        text: "Положили всё необходимое + наклейку, скидочную карту и леденцы, неожиданным было то, что держатель и клип-корд в наборе пришёл не того цвета, меня даже порадовало, вот только разочаровала одна упакованная игла, которую не получилось адекватно достать",
        img: img2,
        inst: "mark_love"
    },
    {
        id: 2,
        text: "Заказал первый раз, заказ пришёл во время, упаковано все отлично, все заказанное соответствует описанию, но есть один маленький ньюанс, коробки все мятые, толи при упаковке так случилось толи на складе так отномятся с товаром, в целом всем доволен, буду заказывать ещё, сайт-магазин рекомендую к покупкам, в целом всем доволен, буду заказывать ещё",
        img: img1,
        inst: "Velli7350"
    },
    {
        id: 3,
        text: "Положили всё необходимое + наклейку, скидочную карту и леденцы, неожиданным было то, что держатель и клип-корд в наборе пришёл не того цвета, меня даже порадовало, вот только разочаровала одна упакованная игла, которую не получилось адекватно достать",
        img: img2,
        inst: "mark_love"
    },
    {
        id: 4,
        text: "Заказал первый раз, заказ пришёл во время, упаковано все отлично, все заказанное соответствует описанию, но есть один маленький ньюанс, коробки все мятые, толи при упаковке так случилось толи на складе так отномятся с товаром, в целом всем доволен, буду заказывать ещё, сайт-магазин рекомендую к покупкам, в целом всем доволен, буду заказывать ещё",
        img: img1,
        inst: "Velli7350"
    },
    {
        id: 5,
        text: "Положили всё необходимое + наклейку, скидочную карту и леденцы, неожиданным было то, что держатель и клип-корд в наборе пришёл не того цвета, меня даже порадовало, вот только разочаровала одна упакованная игла, которую не получилось адекватно достать",
        img: img2,
        inst: "mark_love"
    },{
        id: 6,
        text: "Заказал первый раз, заказ пришёл во время, упаковано все отлично, все заказанное соответствует описанию, но есть один маленький ньюанс, коробки все мятые, толи при упаковке так случилось толи на складе так отномятся с товаром, в целом всем доволен, буду заказывать ещё, сайт-магазин рекомендую к покупкам, в целом всем доволен, буду заказывать ещё",
        img: img1,
        inst: "Velli7350"
    },
    {
        id: 7,
        text: "Положили всё необходимое + наклейку, скидочную карту и леденцы, неожиданным было то, что держатель и клип-корд в наборе пришёл не того цвета, меня даже порадовало, вот только разочаровала одна упакованная игла, которую не получилось адекватно достать",
        img: img2,
        inst: "mark_love"
    },
    
]