import { IServiceItem } from "../types/serviceItem";
import img1 from "../assets/images/services/1.png"
import img2 from "../assets/images/services/2.png"
import img3 from "../assets/images/services/3.png"
import img4 from "../assets/images/services/4.png"

export const servicesData: IServiceItem[] = [
    {   
        id: 0,
        title: "Срочная отправка",
        description: "Дополнительная защита вашего отправления от случайного повреждения и порчи во время доставки. Если с вашими покупками что-то случилось во время доставки — что-то было повреждено, разбито или разлито — мы полностью компенсируем вам убытки. Почтовая гарантия — это ваша абсолютная уверенность, что заказ будет доставлен в целости и сохранности.",
        img: img1,
        price: {moneyPrice: 250,},
    },
    {   
        id: 1,
        title: "Почтовая гарантия",
        description: "Ваши покупки будут упакованы и отправлены в день оформления заказа. Как только заказ будет подтверждён звонком менеджера, наш сотрудник незамедлительно упакует и отправит ваш заказ. Воспользуйтесь данной услугой — это сэкономит вам 1 день ожидания. Данная Услуга особенно актуальна если заказ делается ближе к выходным дням.",
        img: img2,
        price: {procentPrice: 4,},
        
    },
    {   
        id: 2,
        title: "Расширенная гарантия",
        description: "Защитите свои покупки от потери и повреждения! При выборе расширенной почтовой гарантии, мы возмещаем вам полную стоимость приобретённого товара в случае полной утери посылки или повреждения товара в ходе транспортировки посылки почтой России или транспортной компанией. Кроме того, вы получаете нашу 2-х летнюю гарантию на весь товар из вашего заказа",
        img: img3,
        price: {procentPrice: 10,},
        

    },
    {   
        id: 3,
        title: "Подарочное оформление",
        description: "Лучшее решение для подарка. Мы красиво упакуем ваш заказ, отправка будет осуществена курьерской компанией вам или иному адресату, на ваше усмотрение. Детали отправки согласовываются при звонке менеджера для подтверждения заказа.",
        img: img4,
        price: {moneyPrice: 500,},
        
    },
]